;; sec3.1.1.scm のwithdraw手続き

; default : 100
; Peter:
(set! balance (+ balance 10))
; Paul:
(set! balance (- balance 20))
; Mary:
(set! balance (- balance (/ balance 2)))

;; (a). 3つのプロセスをある順序で逐次的に走らせる場合
;;
;; 1. Pe -> Pa -> M  => (((100 + 10) - 20) / 2) => 45
;; 2. Pe -> M  -> Pa => (((100 + 10) / 2) - 20) => 45
;; 3. Pa -> Pe -> M  => (((100 - 20) + 10) / 2) => 45
;; 4. Pa -> M  -> Pe => (((100 - 20) / 2) + 10) => 50
;; 5. M  -> Pa -> Pe => (((100 / 2) - 20) + 10) => 40
;; 6. M  -> Pe -> Pa => (((100 / 2) + 10) - 20) => 40
;;
;; ゆえに 40, 45, 50の3通り


;; (b). システムがプロセスに混ざり合って進むことを許した場合
;;   網羅するいい方法

